[
  {
    "title": "The Postman Always Rings Twice",
    "type": "Book",
    "author": "James M. Cain",
    "rating": 4,
    "releaseYear": 1934,
    "reviewDate": "2026-02-03T21:30:38.533Z",
    "text": "A very short book! It gets an extra star just for that. I like the prose, it's snappy, so there's a decent amount of plot in 122 pages. It doesn't really read like a book that's nearly 100 years old. I suppose in a way it's a love story about two broken people, but there's also lots of murderous noir shenanigans. The narrator's perspective is quite fun, he's telling his own story and probably thinks he's been hard done by in all this, but over time just reveals that he's actually a bit of an idiot (it was funny how the amateurish murder plot was immediately rumbled by the police, albeit that a lawyer managed to get him off because he was able to do a deal with the insurance companies that the police were relying on for their evidence - one bit that did make the book seem from a bygone age). \n",
    "id": "the-postman-always-rings-twice"
  },
  {
    "title": "No Country For Old Men ",
    "type": "Book",
    "author": "Cormac McCarthy",
    "rating": 4,
    "releaseYear": 2005,
    "reviewDate": "2026-02-03T20:51:33.178Z",
    "text": "The first Cormac McCarthy book I've read. It's very similar to the movie, which lessens the suspense a bit if you've seen the movie, all the major plot points are the same (even the fact that Moss is killed off-screen, or off-page). That makes it a bit hard to form a fresh opinion about the book, and probably also meant I speed read it a bit and missed some of the subtlety of the book. So I liked the book, but that might be partly because I like the film. \n\nIt's hard not to comment on the style of the prose, quite minimalist, almost like a screenplay at times, and hardly any punctuation (which I mostly don't mind, although it still the missing apostrophe in words like dont and cant looked weird to me every time). There are also these injections/introspections from the Sheriff periodically, a couple of pages in italics each time. They were a bit of a slog and I pretty much gave up on them half-way through the book.  \n",
    "id": "no-country-for-old-men"
  },
  {
    "title": "How Have You Been?",
    "type": "Music",
    "author": "Giant Rooks?",
    "rating": 3.5,
    "releaseYear": 2024,
    "reviewDate": "2026-01-19T22:05:24.371Z",
    "updatedDate": "2026-02-03T20:24:36.026Z",
    "text": "A German band, sounds like a British Indie band from 2010. I can't quite place what it reminds me of – maybe some combination of Everything Everything, Bastille, Foals, Two Door Cinema Club, The Kooks, The Vaccines, The Walkmen.\n",
    "id": "how-have-you-been"
  },
  {
    "title": "The Rip",
    "type": "Movie",
    "rating": 3,
    "releaseYear": 2026,
    "reviewDate": "2026-01-19T08:42:33.471Z",
    "updatedDate": "2026-02-01T10:15:41.456Z",
    "text": "This is a movie about a police unit who find $20m of drug money hidden in a wall. It's... fine? Didn't hate it, won't remember it. \n\nThere film settled into a decent rhythm in the second act. There was some tension. But the suspense fell away though as the movie went on. The \"whodunnit\" element was given away well in advance, there were so many unsubtle clues, but when they got to the big reveal, it seemed like we were meant to be surprised by it? Maybe this is one of those films where they assume everyone on streaming isn't really paying attention. Subtle it was not. \n\nThe final act didn't work for me. I don't know if I didn't like the way the climactic chase was filmed (fast cutting, hard to follow), or if I'd just lost interest in the outcome by that point.\n\nA final nit about the aesthetic - surely this movie needed something more realistic and grittier, rather than this orange/teal colour grade and hyperreal vibe. \n",
    "id": "the-rip"
  },
  {
    "title": "The Sisters Brothers ",
    "type": "Book",
    "author": "Partrick deWitt",
    "rating": 3.5,
    "releaseYear": 2011,
    "reviewDate": "2026-01-11T13:22:45.216Z",
    "text": "This was worth reading, even if I ultimately wasn't completely invested in the story. The narrator Eli is an interesting character to listen to, he's simple-minded but insightful; empathetic and thoughtful yet also violent. For a while it's fun to go on an odyssey with him and his brother (and their relationship is very nicely drawn), and as they trot across The West and meet a cast of characters along the way, and a lot of the prose flows beautifully, and both our characters and the story keep moving. It all stalled for me when they arrived at their destination though – in the third act and the last third of the book, it started to drag and I realised I actually wasn’t very invested in the outcome and what actually happened to these characters. The characters stopped moving, the story stopped moving. That section felt like it was from a different book - rather than a quirky travel story, we ended up in a more stodgy allegory (the characters were trying to use some chemical to help them find gold even though the chemical was killing them). The denouement after that was nicely done though (and much faster than everything that led up to it). \n",
    "id": "the-sisters-brothers"
  },
  {
    "title": "Highest 2 Lowest",
    "type": "Movie",
    "rating": 3.5,
    "releaseYear": 2025,
    "reviewDate": "2026-01-08T20:22:33.856Z",
    "updatedDate": "2026-02-01T10:06:00.486Z",
    "text": "I enjoyed this film, so it was funny to see afterwards that some people absolutely hated it. I found a Reddit thread about the film that was nothing but negativity, and when they pointed out all these plot holes, I was like \"well, now you mention it, that was a bit silly\". Sometimes I find you can take against a movie for whatever reason, and from then on every nonsensical thing a character will stick out like a sore thumb and annoy the hell out of you. But sometimes you seem to just roll with a movie, and the plot holes don't seem to bother you. For me this film stayed on the right side of that line, I was willing to forgive the implausible moments. There's some action, some moral dilemmas, some good performances. I quite liked it. \n\nThe thing I remember about it most though will probably be some of the music. There's one particularly interesting choice in this movie, which was to use a kind of slightly jazzy folk piece in a lot of the key moments (the main cue is Stony Gate 2, which is a more cinematic version of Stony Gate by Fergus McCreadie - the music was striking enough that I whipped out Shazam at the time to find out what it was). That was an unconventional choice but I thought it really worked - it's propulsive, it's got the simplicity and repetition of folk music, but also a little jazzy edge that suits that moment in the movie. \n",
    "id": "highest-2-lowest"
  },
  {
    "title": "The Art of Loving",
    "type": "Music",
    "author": "Olivia Dean",
    "rating": 3.5,
    "releaseYear": 2025,
    "reviewDate": "2026-01-07T22:38:45.164Z",
    "updatedDate": "2026-02-01T09:55:37.004Z",
    "text": "There's a lovely vibe to this album, it breezes along, it sets the mood. There’s an article by the producers in Sound on sound, and mix engineer Charlie Holmes says “When working on Olivia’s record, she said, ‘I want it to sound like a warm hug all the time.’”.\n\nThat said, it doesn't stick with me - “The Art of Loving is, in all sincerity\", say Pitchfork \"a perfect album to cook or clean to.\" The production is lovely, poppy yet naturalistic. Perhaps a few more risks and experiments would help, something to give it a bit more edge to latch on to. But then I suppose it might not be the warm hug that it is.\n",
    "id": "the-art-of-loving"
  }
]